myFoam/tutorials/myLusgsFoam/hypersonicCylinder/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

// Mesh size  
Nr 320; 
Nv 160;

vertices        
(
    (-1.2 -2.75 0) // 0
    (-0.4 -0.92 0) // 1
    (-0.4  0.92 0) // 2
    (-1.2  2.75 0) // 3

    (-1.2 -2.75 1) // 4
    (-0.4 -0.92 1) // 5
    (-0.4  0.92 1) // 6
    (-1.2  2.75 1) // 7
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) ($Nv $Nr 1) simpleGrading (1 1 1)
);

edges           
(
    arc 1 2 (-1 0 0)
    arc 5 6 (-1 0 1)

    arc 0 3 (-3 0 0)
    arc 4 7 (-3 0 1)
);

boundary         
(
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (2 6 5 1)            
        );
    }
);

mergePatchPairs 
(
);

// ************************************************************************* //
